MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4320/mcu.h
extern volatile OSCTUN2bits_t OSCTUN2bits __at(0xF9A);
// bitfield macros
#define _OSCTUN2_TUN_POSN                                   0x0
#define _OSCTUN2_TUN_POSITION                               0x0
#define _OSCTUN2_TUN_SIZE                                   0x6
#define _OSCTUN2_TUN_LENGTH                                 0x6
#define _OSCTUN2_TUN_MASK                                   0x3F
#define _OSCTUN2_TUNSEL_POSN                                0x7
#define _OSCTUN2_TUNSEL_POSITION                            0x7
#define _OSCTUN2_TUNSEL_SIZE                                0x1
#define _OSCTUN2_TUNSEL_LENGTH                              0x1
#define _OSCTUN2_TUNSEL_MASK                                0x80
#define _OSCTUN2_TUN0_POSN                                  0x0
#define _OSCTUN2_TUN0_POSITION                              0x0
#define _OSCTUN2_TUN0_SIZE                                  0x1
#define _OSCTUN2_TUN0_LENGTH                                0x1
#define _OSCTUN2_TUN0_MASK                                  0x1
#define _OSCTUN2_TUN1_POSN                                  0x1
#define _OSCTUN2_TUN1_POSITION                              0x1
#define _OSCTUN2_TUN1_SIZE                                  0x1
#define _OSCTUN2_TUN1_LENGTH                                0x1
#define _OSCTUN2_TUN1_MASK                                  0x2
#define _OSCTUN2_TUN2_POSN                                  0x2
#define _OSCTUN2_TUN2_POSITION                              0x2
#define _OSCTUN2_TUN2_SIZE                                  0x1
#define _OSCTUN2_TUN2_LENGTH                                0x1
#define _OSCTUN2_TUN2_MASK                                  0x4
#define _OSCTUN2_TUN3_POSN                                  0x3
#define _OSCTUN2_TUN3_POSITION                              0x3
#define _OSCTUN2_TUN3_SIZE                                  0x1
#define _OSCTUN2_TUN3_LENGTH                                0x1
#define _OSCTUN2_TUN3_MASK                                  0x8
#define _OSCTUN2_TUN4_POSN                                  0x4
#define _OSCTUN2_TUN4_POSITION                              0x4
#define _OSCTUN2_TUN4_SIZE                                  0x1
#define _OSCTUN2_TUN4_LENGTH                                0x1
#define _OSCTUN2_TUN4_MASK                                  0x10
#define _OSCTUN2_TUN5_POSN                                  0x5
#define _OSCTUN2_TUN5_POSITION                              0x5
#define _OSCTUN2_TUN5_SIZE                                  0x1
#define _OSCTUN2_TUN5_LENGTH                                0x1
#define _OSCTUN2_TUN5_MASK                                  0x20

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0xF9B);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 0F9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :6;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
        unsigned TUN5                   :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0xF9B);
// bitfield macros
#define _OSCTUNE_TUN_POSN                                   0x0
#define _OSCTUNE_TUN_POSITION                               0x0
#define _OSCTUNE_TUN_SIZE                                   0x6
#define _OSCTUNE_TUN_LENGTH                                 0x6
#define _OSCTUNE_TUN_MASK                                   0x3F
#define _OSCTUNE_TUN0_POSN                                  0x0
#define _OSCTUNE_TUN0_POSITION                              0x0
#define _OSCTUNE_TUN0_SIZE                                  0x1
#define _OSCTUNE_TUN0_LENGTH                                0x1
#define _OSCTUNE_TUN0_MASK                                  0x1
#define _OSCTUNE_TUN1_POSN                                  0x1
#define _OSCTUNE_TUN1_POSITION                              0x1
#define _OSCTUNE_TUN1_SIZE                                  0x1
#define _OSCTUNE_TUN1_LENGTH                                0x1
#define _OSCTUNE_TUN1_MASK                                  0x2
#define _OSCTUNE_TUN2_POSN                                  0x2
#define _OSCTUNE_TUN2_POSITION                              0x2
#define _OSCTUNE_TUN2_SIZE                                  0x1
#define _OSCTUNE_TUN2_LENGTH                                0x1
#define _OSCTUNE_TUN2_MASK                                  0x4
#define _OSCTUNE_TUN3_POSN                                  0x3
#define _OSCTUNE_TUN3_POSITION                              0x3
#define _OSCTUNE_TUN3_SIZE                                  0x1
#define _OSCTUNE_TUN3_LENGTH                                0x1
#define _OSCTUNE_TUN3_MASK                                  0x8
#define _OSCTUNE_TUN4_POSN                                  0x4
#define _OSCTUNE_TUN4_POSITION                              0x4
#define _OSCTUNE_TUN4_SIZE                                  0x1
#define _OSCTUNE_TUN4_LENGTH                                0x1
#define _OSCTUNE_TUN4_MASK                                  0x10
#define _OSCTUNE_TUN5_POSN                                  0x5
#define _OSCTUNE_TUN5_POSITION                              0x5
#define _OSCTUNE_TUN5_SIZE                                  0x1
#define _OSCTUNE_TUN5_LENGTH                                0x1
#define _OSCTUNE_TUN5_MASK                                  0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xF9D);
#ifndef _LIB_BUILD
asm("PIE1 equ 0F9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned CCP1IE                 :1;
        unsigned SSPIE                  :1;
        unsigned TXIE                   :1;
        unsigned RCIE                   :1;
        unsigned ADIE                   :1;
        unsigned PSPIE                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
    };
} PIE1bits_t;
